In [19]:
import pandas as pd
import sqlalchemy
# create connection
engine = sqlalchemy.create_engine('mysql+pymysql://root:1234@localhost:3306/todo_backend')

In [20]:
# Read entire table in a dataframe using read_sql_table
df = pd.read_sql_table('tasks', engine)
df

,id,user_id,note,completed,repeats,deadline,reminder
0,1,2,Coding,0,One Times,2021-04-01,"2021-03-01,2021-03-15,2021-03-31"

In [22]:
# Read only selected columns
df = pd.read_sql_table('tasks', engine, columns=['note'])
df

     note
0  Coding

In [23]:
# Join two tables and read them in a dataframe using read_sql_query
df = pd.read_sql_query('select user_id, note from tasks', engine)
df

   user_id    note
0        2  Coding

In [25]:
query = '''
 SELECT u.username, t.note
 FROM tasks as t INNER JOIN users u
 ON t.user_id=u.id
'''
df = pd.read_sql_query(query,engine)
df

  username    note
0   zab007  Coding

In [26]:
# read_sql is a wrapper around read_sql_query and read_sql_table
query = '''
 SELECT u.username, t.note
 FROM tasks as t INNER JOIN users u
 ON t.user_id=u.id
'''
df = pd.read_sql(query,engine)
df

  username    note
0   zab007  Coding

In [27]:
df = pd.read_sql('users', engine)
df

,id,username,first_name,last_name,password,email,token
0,2,zab007,Amal,Nishan,123456,amal@gmail.com,eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6M...

In [31]:
# Write to mysql database using to_sql
df = pd.DataFrame({
    "id": 3,
    "username": "zayn",
    "first": "zayn",
    "last": "malik",
    "pass": 1234,
    "email": "zayn@gmail.com",
    "token": "satfhdsjhfdghfjfhgdvxvsfvdsvcdb" 
},index=[0])
df

,id,username,first,last,pass,email,token
0,3,zayn,zayn,malik,1234,zayn@gmail.com,satfhdsjhfdghfjfhgdvxvsfvdsvcdb

In [32]:
df.rename(columns={
    'first': 'first_name',
    'last': 'last_name',
    'pass': 'password'
}, inplace=True)
df

,id,username,first_name,last_name,password,email,token
0,3,zayn,zayn,malik,1234,zayn@gmail.com,satfhdsjhfdghfjfhgdvxvsfvdsvcdb

In [33]:
df.to_sql(
    name='users', # database table name
    con=engine,
    if_exists='append',
    index=False
)